{
  "parallaxText": {
    "about": {
      "title": "Über Leo",
      "subtitle": "Ich liebe es komplexe und abstrakte Probleme runterzubrechen und zu lösen!"
    },
    "experience": {
      "title": "Berufserfahrung <br>und Bildung",
      "subtitle": "Ich möchte meinen Horizont erweitern, indem ich Neues lerne und mich Herausforderungen stelle!"
    },
    "projects": {
      "title": "Projekt-Erfahrung",
      "subtitle": "Inspiration durch meine Projekte"
    }
  },
  "experience": {
    "intro": {
      "title": "Berufserfahrung <br>und Bildung",
      "subtitle": "Ich möchte meinen Horizont erweitern, indem ich Neues lerne und mich Herausforderungen stelle!"
    },
    "workExperience": "Berufserfahrung",
    "education": "Bildung"
  },
  "socialTitle": "Kontakt",
  "about": {
    "intro": {
      "title": "Über Leo",
      "subtitle": "Ich liebe es komplexe und abstrakte Probleme runterzubrechen und zu lösen!"
    },
    "introHeader": "Was ist für Dich am wichtigsten?",
    "friendsAndFamily": "Für mich haben meine Familie und Freunde die höchste Priorität, denn ohne ein tolles soziales Leben als Fundament kann man leicht unausgeglichen sein, ausbrennen und den Blick für das Wesentliche im Leben verlieren. Deswegen versuche ich mich so oft es geht mit meiner Familie und meinen Freunden tolle Erinnerungen an zum Beispiel faszinierende Ausflüge und tolle Partys zu kreiren. Dazu gehören z. B. unsere jährlichen Skiausflüge, Wochenendtrips oder Karneval mit einer Gruppe von Freunden und meiner Familie in Köln.",
    "career": "<p>Neben meinem Privatleben investiere ich viel Energie in meine Arbeit und Karriere da ich eine Leidenschaft für verschiedene IT-Themen habe. Deswegen studiere ich Information Systems (M. Sc.) in Münster und habe zwei Nebenjobs mit IT-Fokus. Die Jobs sind am Lehrstuhl für Wirtschaftsinformatik und Informationsmanagement als studentische Hilfskraftund als Werkstudent bei viadee in der Forschung und Entwicklung im Data Science Bereich.Zudem konnte ich mein Skillset durch Consulting-Projekte bei   <a href='https://move-ev.de/' target='_blank'>move e. V.</a> erweitern. Außerdem habe ich weitere Projekte abgeschlossen in meiner Freizeit oder in der Universiät. Weitere Einblicke in diese und andere Projekte können in meiner <a href='/experience'>Erfahrungsübersicht</a> gefunden werden.</p>",
    "sport": "Neben der Arbeit und meinem Privatleben bin ich auch sportlich sehr ambitioniert, denn ich möchte auf verschiedene Weise an meine Grenzen gehen: Zum Beispiel versuche ich, mein Laufen zu verbessern. Außerdem bin ich mit 16 Jahren einen Halbmarathon gelaufen und laufe knapp unter 4 min/km auf meiner Strecke von 10 km. Innerhalb der letzten Jahre habe ich mich auf einen Halbmarathon in unter 1h 30 min gesteigert (siehe <a href='https://www.strava.com/athletes/17923080' target='_blank'>Strava</a>). Zur Schulzeit habe ich ein Jahrzehnt lang Fußball gespielt und konnte mich in der Bezirksliga beweisen. Aktuell spiele ich nur entspannt mit Freunden. Dafür mache ich Tennis, Home-Workouts und Beach- und Hallenvolleyball aktiver. </br> Mein Lieblings-Sport ist das Skifahren, weil ich das unglaubliche Gefühl liebe, wenn man schnell durch den Schnee gleitet und die tolle Aussicht genießen kann. Es macht auch Spaß Touren im Gelände mit Aufsteigen zu machen und dann durch unberührten Schnee zu fahren. Deshalb fahre ich jedes Jahr mit meiner Familie zum Skifahren nach <a href='https://www.bergfex.com/lech-zuers-arlberg/' target='_blank'>Lech</a> (Österreich), mit Freunden nach <a href='https://www.bergfex.com/soelden/' target='_blank'>Sölden</a> oder mit dem Hoschulsport nach <a href='https://www.bergfex.com/portes-du-soleil/' target='_blank'>Portes du Soleil</a> (Schweiz-Frankreich), was immer ein ereignisreiches und spannendes Erlebnis ist, denn man lernt viele coole Leute kennen.",
    "travel": "Außerdem möchte ich gerne neue Orte erkunden und verschiedene Kulturen kennenlernen, z.B. Asien und Süd- oder Mittelamerika. Konkret würde ich gerne nach Japan und Argentinien reisen, Chile oder Nicaragua. Außerdem würde ich gerne Kanada besuchen, weil ich tolle Landschaften mag und nach dem, was ich gehört habe, hat es viel zu bieten.",
    "quote": "Zum Schluss möchte ich mit einem Zitat abschließen, das meine Lebenseinstellung auf den Punkt bringt:"
  }
}
