{
  "home": {
    "homeHero": {
      "title": "Fortschritt mit Leidenschaft",
      "subtitle": "Faszination für revolutionäre Informationstechnologien und deren Anwendung in der Wirtschaft"
    },
    "homeIntro": {
      "title": "Ich liebe es zu lernen und mein Wissen in dynamischen Teams anzuwenden!",
      "text": "Ich bin fasziniert von Informations-Technologien, insbesondere Machine Learning. Diese Leidenschaft treibt mich an, Information Systems an der Universität Münster mit Schwerpunkt Business Intelligence zu studieren. Durch Praktika und Werkstudententätigkeiten habe ich mein theoretisches Wissen in die Praxis umgesetzt. In persönlichen und Praxisprojekten bei der studentischen Unternehmensberatung move erweitere ich kontinuierlich meine analytischen und konzeptionellen Fähigkeiten. Derzeit strebe ich an, meine Führungsqualitäten als Vorstandsvorsitzender und Projektleiter bei move weiter auszubauen.Ich bin fasziniert von Informations-Technologien, insb. Machine Learning. Diese Leidenschaft treibt mich an, Information Systems an der Universität Münster mit Schwerpunkt Business Intelligence zu studieren. Durch Praktika und Werkstudententätigkeiten habe ich mein theoretisches Wissen in die Praxis umgesetzt. In persönlichen und Praxisprojekten bei der studentischen Unternehmensberatung move erweitere ich kontinuierlich meine analytischen und konzeptionellen Fähigkeiten. Derzeit strebe ich an, meine Führungsqualitäten als Vorstandsvorsitzender und Projektleiter bei move weiter auszubauen.",
      "downloadCV": "Lebenslauf"
    },
    "skills": {
      "mlbiTitle": "Artificial Intelligence \n& Machine Learning",
      "mlbi": "Meine Reise im Bereich Machine Learning begann mit dem Erlernen der Python-Grundlagen während meines Studiums und durch Online-Kurse in meiner Freizeit. Durch eine <a href='/#/projects#DLCaseStudy'>Fallstudie</a> im fortgeschrittenen Modul „Deep Learning mit Python“ und die Vorbereitung einer Vorlesung zur Einführung in Machine Learning erlangte ich Einblicke, wie künstliche Intelligenz funktioniert, ihre aktuellen Grenzen und Möglichkeiten. Mein Wissen im Bereich Machine Learning vertiefte ich in einem <a href='/#/projects#NLP'>Praktikum</a>, einer weiteren <a href='/#/projects#ForestHeight'>Fallstudie</a> über die Regression der Baumhöhen im Schwarzwald, und meiner <a href='/#/projects#BA'>Bachelorarbeit</a> zur semantischen Segmentierung von Bäumen in Südafrika mit Satellitenbildern. Darüber hinaus befasste ich mich in weiteren Projekten mit Machine Learning, wie einem <a href='/#/projects#DImensaToday'>intelligenten Empfehlungssystem für die Mensa</a> und der <a href='/#/projects#AutomationOfDocumentChecks'>Automatisierung von Dokumentenprüfungen</a>. Aufgrund von dieser Faszination für Machine Learning habe ich es auch als Schwerpunkt in meinem Studium gewählt.Die Anwendung dieser Technologien in verschiedenen Projekten erweiterte nicht nur mein Fachwissen, sondern verstärkte auch meine Leidenschaft für die Entwicklung innovativer Lösungen, die reale Probleme adressieren und echten Mehrwert schaffen.",

      "dataScienceTitle": "Data Science &\nData Analysis",
      "dataScienceText": "In meiner Zeit als Data Scientist bei der IT-Beratung <a href='/#/experience#card-viadee'>viadee</a> habe ich wertvolle Erfahrungen im Bereich Data Science und Datenanalyse gesammelt.Meine Arbeit konzentrierte sich auf die Verbesserung von Geschäftsprozessen in der Industrie 4.0, unter Einsatz von BPMN 2.0, Machine Learning, Datenanalytik, Process Mining und Forschung.Diese Tätigkeiten ermöglichten es mir, meine theoretischen Kenntnisse und die praktische Umsetzung von Machine Learning-Modellen sowie Datenanalysemethoden zu vertiefen.Durch die Teilnahme an einem Microsoft PowerBI-Workshop bei dem <a href='https://bdsu.de/unternehmen/' target='_blank'>BDSU</a>erweiterte ich meine Fähigkeiten in der visuellen Datenanalyse, was mir ermöglichte, komplexe Datensätze effektiv zu interpretieren und zu visualisieren.Ein markantes Projekt in diesem Kontext war die <a href='/#/projects#UASentimentAnalysis'>Analyse</a> der politischen Stimmung zu Donald Trump und Boris Johnson durch soziale Medien, wo ich mittels fortschrittlicher Datenanalysemethoden geografische Einblicke in die öffentliche Meinung gewann.Diese Erfahrungen unterstreichen meine Fähigkeit, Datenwissenschaft und -analyse anzuwenden, um fundierte Einblicke zu gewinnen und strategische Entscheidungen zu unterstützen.",
      "feTitle": "Web\nDevelopment",
      "frontend": "In meinem Portfolio erstrecken sich die Webentwicklungskompetenzen vom Frontend über Webscraping bis hin zu Backend und Datenbanken, zum Einsatz gekommen in einer Vielzahl von Projekten.Ich habe das <strong>Frontend</strong> mehrerer Websites entwickelt, einschließlich einer <a href='/#/projects#goc'>webbasierten Simulationsplattform</a> und einem bemerkenswerten <a href='/#/projects#DImensaToday'>intelligenten Mensa-Empfehlungssystem</a>. Auch meine eigene <a href='/#/projects#portfolioWebDevelopment'>Portfolio-Website</a> sowie das Frontend für das Projekt <a href='/#/projects#AutomationOfDocumentChecks'>zur Automatisierung von Dokumentenprüfungen</a> stammen aus meiner Hand.Darüber hinaus war ich beim Frontend von <a href='/#/projects#watchtrainer'>watchTrainer</a> maßgeblich beteiligt.Diese Projekte wurden mit Vue.js realisiert. Ebenso sicher bewege ich mich im Umgang mit CMS wie WordPress, was in Projekten wie der <a href='/#/projects#eBusinessWebDevelopment'>Entwicklung eines eBusiness</a> und der <a href='/#/projects#lawFirmWebDevelopment'>Webentwicklung für eine Anwaltskanzlei</a> zum Ausdruck kommt, die ich eigenständig umgesetzt habe. ",
      "beTitle": "Backend &\nDatenbanken",
      "backend": "Für die Kommunikation mit dem Backend nutzte ich vorrangig REST oder GraphQL API-Aufrufe und sammelte Erfahrungen mit <strong>Datenbanken</strong>, beispielsweise beim Erstellen von Entity-Relationship-Modellen (ERM) und beim Umgang mit SQL. Diese Fähigkeiten kamen sowohl in universitären Projekten als auch in Arbeiten wie <a href='/#/projects#watchtrainer'>watchTrainer</a> und <a href='/#/projects#goc'>Game of Competences</a> zur Anwendung.Beim <strong>Webscraping</strong> konnte ich in mehreren Projekten wertvolle Daten von Websites extrahieren. So entwickelte ich beispielsweise für Diskussionsforen einen <a href='/#/projects#forum_web_scraper'>skalierbaren Web-Scraper</a>, um Innovationspotenziale zu erkennen. Zusätzlich setzte ich Webscraping bei <a href='/#/experience#card-move'>move</a> in einem internen Wettbewerb ein, um mit hoher Sicherheit den Gewinner von Bundesliga-Spielen vorherzusagen.",
      "itArchitectureTitle": "IT-Architektur",
      "itArchitecture": "Im Modul für Enterprise Architekturmanagement spezialisierte ich mich auf die Modellierung der (IT)-Unternehmensstruktur mit ArchiMate. Diese Grundlage ermöglichte es mir, eine detaillierte Fallstudie durchzuführen und das TOGAF-Framework von The Open Group zu nutzen. Ein bedeutendes Projekt bei <a href='/#/experience#card-move'>move</a> umfasste die Analyse und <a href='/#/projects#ITArchitecture'>Optimierung der IT-Infrastruktur</a> eines Unternehmens im öffentlichen Verkehrsbereich, unter Einsatz von TOGAF und ArchiMate, um Effizienzengpässe in Bereichen wie Laufwerkzugriff, Kalendermanagement, Entscheidungsfindung und Videokonferenzen zu beheben. Mit der Entwicklung eines umfassenden Transformationsplans führte ich die Integration von Microsoft 365 durch, um die Zusammenarbeit und Kommunikation zu verbessern und den Weg für den Übergang in die Cloud zu ebnen. Der Kunde war mit der Leistung des Projekts so zufrieden, dass das Unternehmen mich für ein weiteres Beratungsprojekt als Projektleiter beauftragte. Die Leitung dieses Projekts unterstrich meine Geschicklichkeit im IT-Projektmanagement, meine Beherrschung moderner IT-Architekturen und die Innovation von Lösungen für komplexe technische Herausforderungen.",
      "officeTitle": "Microsoft Office 365",
      "office": "Seit der siebten Klasse arbeite ich nahezu täglich mit <strong>Microsoft PowerPoint</strong>, <strong>Word</strong> und <strong>Excel</strong>, was ich als studentische Hilfskraft am <a href='/#/experience#experience'>Lehrstuhl für Wirtschaftsinformatik</a> an der Universität Münster durch die Vorbereitung von PowerPoint-Vorlesungen weiter vertiefte.Meine Expertise in Microsoft Office wurde durch die Erstellung verschiedener Präsentationen bei <a href='/#/experience#card-move'>move</a> und die Teilnahme an Workshops wie BCG und BCG Platinion weiter gefördert, was meine Präsentationsfähigkeiten erheblich verbesserte.In Uni-Projekten und bei move verbrachte ich viel Zeit mit der schnellen Erstellung und Optimierung von Präsentationen, unter anderem durch die Korrektur von Präsentationen für mehrere Anwärterprojekte.Zudem habe ich an der Universität Münster Zertifikate für PowerPoint und Excel erworben, die jedoch meine Fähigkeiten nur ansatzweise widerspiegeln.Ich setze gerne ThinkCell ein und beherrsche Efficient Elements sowie Makros.Zuletzt arbeitete ich bei move in der IT-Abteilung mit <strong>Microsoft PowerApps</strong> und <strong>Flows</strong>, verbunden mit <strong>SharePoint</strong>-Datenbanken, was meine Fähigkeit unterstreicht, das volle Potenzial von Microsoft Office 365 zu nutzen, um Prozesse zu optimieren und die Produktivität zu steigern.",
      "sdevTitle": "Software\nEntwicklung",
      "softwareDev": "Ein Softwareentwickler muss mathematisches Verständnis und <strong>Problemlösungsfähigkeiten</strong> besitzen. Diese habe ich mir in meinem Studiengang Wirtschaftsinformatik zusammen mit Programmiersprachen wie <strong>Java</strong> angeeignet. Um ehrlich zu sein, bevorzuge ich <strong>JavaScript</strong> und habe damit bereits z.B. eine <a href='/#/projects#goc'>Web-App</a> implementiert. In diesem Projekt konnte ich ebenfalls mein <strong>Zeitmanagement</strong>, meine Selbstorganisation als auch die Koordination im Team verbessern, da ich ein Team von sieben Kommilitonen leitete. Gründliches und detailliertes Arbeiten werden langfristig belohnt, wie ich im Verlaufe der Web-App Implementation festgestellt habe. </br>Ich freue mich darauf, weitere Erfahrungen in der Softwareentwicklung zu sammeln und meinen Horizont kontinuierlich zu erweitern und mich den sich ständig und schnell ändernden Technologietrends anzupassen.",
      "otherTitle": "Weitere Fähigkeiten",
      "other": "An der WWU habe ich <strong>Process Mining</strong> und <strong>Prozessmodellierung</strong> mit BPMN und EPK gelernt. Darüber hinaus habe ich <strong>SCRUM</strong> an meiner Universität und in einem <a href='https://www.lhconsulting.com/' target='_blank'>Lufthansa Consulting</a> Workshop bei der <a href='https://consultingcontact.de/' target='_blank'>Consulting Contact</a> gelernt. Dieses theoretische Wissen habe ich habe ich in realen Situationen angewendet, wie zum Beispiel im Projektseminar <a href='/#/projects#goc'>Game of Competences</a> und in zwei Webentwicklungsprojekten bei <a href='/#/experience#card-move'>move</a>."
    }
  },
  "parallaxText": {
    "about": {
      "title": "Über Leo",
      "subtitle": "Ich liebe es komplexe und abstrakte Probleme runterzubrechen und zu lösen!"
    },
    "experience": {
      "title": "Berufserfahrung <br>und Bildung",
      "subtitle": "Ich möchte meinen Horizont erweitern, indem ich Neues lerne und mich Herausforderungen stelle!"
    },
    "projects": {
      "title": "Projekt-Erfahrung",
      "subtitle": "Inspiration durch meine Projekte"
    }
  },
  "experience": {
    "intro": {
      "title": "Berufserfahrung <br>und Bildung",
      "subtitle": "Ich möchte meinen Horizont erweitern, indem ich Neues lerne und mich Herausforderungen stelle!"
    },
    "workExperience": "Berufserfahrung",
    "education": "Bildung"
  },
  "socialTitle": "Kontakt",
  "about": {
    "intro": {
      "title": "Über Leo",
      "subtitle": "Ich liebe es komplexe und abstrakte Probleme runterzubrechen und zu lösen!"
    },
    "introHeader": "Was ist für Dich am wichtigsten?",
    "friendsAndFamily": "Für mich haben meine Familie und Freunde die höchste Priorität, denn ohne ein tolles soziales Leben als Fundament kann man leicht unausgeglichen sein, ausbrennen und den Blick für das Wesentliche im Leben verlieren. Deswegen versuche ich mich so oft es geht mit meiner Familie und meinen Freunden tolle Erinnerungen an zum Beispiel faszinierende Ausflüge und tolle Partys zu kreiren. Dazu gehören z. B. unsere jährlichen Skiausflüge, Wochenendtrips oder Karneval mit einer Gruppe von Freunden und meiner Familie in Köln.",
    "career": "<p>Neben meinem Privatleben investiere ich viel Energie in meine Arbeit und Karriere da ich eine Leidenschaft für verschiedene IT-Themen habe. Deswegen studiere ich Information Systems (M. Sc.) in Münster und habe zwei Nebenjobs mit IT-Fokus. Die Jobs sind am Lehrstuhl für Wirtschaftsinformatik und Informationsmanagement als studentische Hilfskraftund als Werkstudent bei viadee in der Forschung und Entwicklung im Data Science Bereich.Zudem konnte ich mein Skillset durch Consulting-Projekte bei <a href='https://move-ev.de/' target='_blank'>move e. V.</a> erweitern. Außerdem habe ich weitere Projekte abgeschlossen in meiner Freizeit oder in der Universiät. Weitere Einblicke in diese und andere Projekte können in meiner <a href='/experience'>Erfahrungsübersicht</a> gefunden werden.</p>",
    "sport": "Neben der Arbeit und meinem Privatleben bin ich auch sportlich sehr ambitioniert, denn ich möchte auf verschiedene Weise an meine Grenzen gehen: Zum Beispiel versuche ich, mein Laufen zu verbessern. Außerdem bin ich mit 16 Jahren einen Halbmarathon gelaufen und laufe knapp unter 4 min/km auf meiner Strecke von 10 km. Innerhalb der letzten Jahre habe ich mich auf einen Halbmarathon in unter 1h 30 min gesteigert (siehe <a href='https://www.strava.com/athletes/17923080' target='_blank'>Strava</a>). Zur Schulzeit habe ich ein Jahrzehnt lang Fußball gespielt und konnte mich in der Bezirksliga beweisen. Aktuell spiele ich nur entspannt mit Freunden. Dafür mache ich Tennis, Home-Workouts und Beach- und Hallenvolleyball aktiver. </br> Mein Lieblings-Sport ist das Skifahren, weil ich das unglaubliche Gefühl liebe, wenn man schnell durch den Schnee gleitet und die tolle Aussicht genießen kann. Es macht auch Spaß Touren im Gelände mit Aufsteigen zu machen und dann durch unberührten Schnee zu fahren. Deshalb fahre ich jedes Jahr mit meiner Familie zum Skifahren nach <a href='https://www.bergfex.com/lech-zuers-arlberg/' target='_blank'>Lech</a> (Österreich), mit Freunden nach <a href='https://www.bergfex.com/soelden/' target='_blank'>Sölden</a> oder mit dem Hoschulsport nach <a href='https://www.bergfex.com/portes-du-soleil/' target='_blank'>Portes du Soleil</a> (Schweiz-Frankreich), was immer ein ereignisreiches und spannendes Erlebnis ist, denn man lernt viele coole Leute kennen.",
    "travel": "Außerdem möchte ich gerne neue Orte erkunden und verschiedene Kulturen kennenlernen, z.B. Asien und Süd- oder Mittelamerika. Konkret würde ich gerne nach Japan und Argentinien reisen, Chile oder Nicaragua. Außerdem würde ich gerne Kanada besuchen, weil ich tolle Landschaften mag und nach dem, was ich gehört habe, hat es viel zu bieten.",
    "quote": "Zum Schluss möchte ich mit einem Zitat abschließen, das meine Lebenseinstellung auf den Punkt bringt:"
  }
}
