{
  "home": {
    "homeHero": {
      "title": "Progress with Passion",
      "subtitle": "Fascination for revolutionizing information technologies and their application in business"
    },
    "homeIntro": {
      "title": "I love to learn and apply my knowledge in dynamic teams!",
      "text": "  I am fascinated by information technologies, especially Machine Learning. This passion drives me to study Information Systems at the University of Münster with a focus on Business Intelligence. Through internships and part-time work, I have applied my theoretical knowledge in practice. In personal leisure projects and practical projects at the student consultancy move, I continuously enhance my analytical and conceptual skills. Currently, I aim to further develop my leadership qualities as Chairman of the Board and project manager at move.I am fascinated by information technologies, especially Machine Learning. This passion drives me to study Information Systems at the University of Münster with a focus on Business Intelligence. Through internships and part-time work, I have applied my theoretical knowledge in practice. In personal leisure projects and practical projects at the student consultancy move, I continuously enhance my analytical and conceptual skills. Currently, I aim to further develop my leadership qualities as Chairman of the Board and project manager at move.",
      "downloadCV": "CV"
    },
    "skills": {
      "mlbiTitle": "Artificial Intelligence \n& Machine Learning",
      "mlbi": "My journey in machine learning started with acquiring the basics of Python during my studies and through online courses in my spare time. Through a <a href='/#/projects#DLCaseStudy'>case study</a>  in the advanced module 'Deep Learning with Python' and the preparation of a lecture on the introduction to machine learning, I gained insights into how artificial intelligence works, its current limitations, and possibilities. I deepened my machine learning knowledge in an <a href='/#/projects#NLP'>internship</a>, another<a href='/#/projects#ForestHeight'>case study</a> about regressing the tree heights in the German Black Forest, and my <a href='/#/projects#BA'>bachelor thesis</a> on the semantic segmentation of trees in South Africa using satellite imagery. Moreover, I touched on machine learning in further projects, such as a <a href='/#/projects#DImensaToday'>smart dining recommender system</a> and the <a href='/#/projects#AutomationOfDocumentChecks'>automation of document checks</a>.This fascination led me to choose it as a focus in my Information Systems studies. The application of these technologies in various projects not only broadened my expertise but also reinforced my passion for developing innovative solutions that address real-world problems and create genuine value.",
      "dataScienceTitle": "Data Science &\nData Analysis",
      "dataScienceText": "During my tenure as a Data Scientist at the IT consultancy <a href='/#/experience#card-viadee'>viadee</a>, I gained invaluable experience in data science and data analysis. My work focused on improving target business processes in Industry 4.0, utilizing BPMN 2.0, Machine Learning, Data Analytics, Process Mining, and research. These activities allowed me to deepen my theoretical knowledge and practical implementation of machine learning models and data analysis techniques. Participating in a Microsoft PowerBI workshop from the <a href='https://bdsu.de/unternehmen/' target='_blank'>BDSU</a>expanded my capabilities in visual data analysis, enabling me to effectively interpret and visualize complex datasets. A notable related project is the <a href='/#/projects#UASentimentAnalysis'>analysis</a> of political sentiment towards Donald Trump and Boris Johnson through social media, where I employed advanced data analysis methods to gain geographical insights into public opinion. These experiences highlight my ability to apply data science and analysis to obtain meaningful insights and support strategic decisions.",
      "feTitle": "Frontend Web\nDevelopment",
      "frontend": "My web development skills comprise from webscraping, frontend to backend development, utilized in a myriad of projects. I have developed the <strong>frontend</strong> of multiple websites, including a <a href='/#/projects#goc'>web-based simulation platform</a> and the notable project of a <a href='/#/projects#DImensaToday'>smart dining recommender system</a>.  My own <a href='/#/projects#portfolioWebDevelopment'>portfolio website</a> and the frontend for the <a href='/#/projects#AutomationOfDocumentChecks'>automation of document checks</a> project were independently executed by me. Additionally, I worked on the frontend of <a href='/#/projects#watchtrainer'>watchTrainer</a>. These projects were programmed using the Vue.js framework, and I am also comfortable with CMS like WordPress, achieving customer-focused results in projects, as seen in the <a href='/#/projects#eBusinessWebDevelopment'>development of an eBusiness</a> and <a href='/#/projects#lawFirmWebDevelopment'>law firm website</a>.",

      "beTitle": "Backend &\nDatabases",
      "backend": "Primarily, I communicated with the backend via REST or GraphQL API calls. I have some experience with it and <strong>databases</strong>, e.g., building an Entity-Relationship Model (ERM) and retrieving data in SQL. These skills were acquired and applied at university and in projects like <a href='/#/projects#watchtrainer'>watchTrainer</a> and <a href='/#/projects#goc'>Game of Competences</a>.  I extracted data from websites in multiple projects. For example, I built a <a href='/#/projects#forum_web_scraper'>scalable web scraper</a> for discussion forums to identify innovation potential. Additionally, I applied <strong>webscraping</strong> at <a href='/#/experience#card-move'>move</a> in an internal competition to determine the winner of Bundesliga matches with high certainty.",

      "itArchitectureTitle": "IT-Architecture",
      "itArchitecture": "In the Enterprise Architecture Management module, I honed my skills in modeling the structure of organizations with an IT focus using ArchiMate. This foundation allowed me to conduct a detailed case study and leverage the TOGAF Framework by The Open Group. A significant project at <a href='/#/experience#card-move'>move</a>  involved analyzing and  <a href='/#/projects#ITArchitecture'>optimizing the IT infrastructure</a>  of a public transportation company, employing TOGAF and ArchiMate to address efficiency bottlenecks in areas such as drive access, calendar management, decision-making, and video conferencing. Developing a comprehensive transformation plan, I spearheaded the integration of Microsoft 365 to enhance collaboration and communication, paving the way for cloud transition. The customer was so pleased with the project performance that the company commissioned another consulting project with me as a project lead. Leading this project, I demonstrated my adeptness in IT project management, mastery of modern IT architectures, and the innovation of solutions for complex technical issues.",

      "officeTitle": "Microsoft Office 365",
      "office": "Since seventh grade, I've been using <strong>Microsoft PowerPoint</strong>, <strong>Word</strong>, and <strong>Excel</strong> almost daily, honing my skills further while preparing lectures in PowerPoint as a student assistant at the <a href='/#/experience#experience'>Chair of Information Systems</a> at the University of Münster. My expertise with Microsoft Office deepened through creating various presentations at <a href='/#/experience#card-move'>move</a> and attending workshops like BCG and BCG Platinion, enhancing my presentation skills. I've dedicated considerable time to the fast generation and optimization of presentations in university projects and at move, including correcting presentations for several candidate projects. Moreover, I've earned PowerPoint and Excel certifications at the University of Münster, which only scratch the surface of my abilities. I enjoy using ThinkCell, and I'm proficient with Efficient Elements and macros. Recently, I've worked in the IT department at move, utilizing <strong>Microsoft PowerApps</strong> and <strong>Flows</strong> integrated with <strong>SharePoint</strong> databases, showcasing my versatility and capability to leverage Microsoft Office 365's full suite to streamline processes and enhance productivity.",

      "otherTitle": "Other Skills",
      "other": "At university, I studied and applied <strong>Process Mining</strong> and <strong>Modelling</strong>  with BPMN and EPK. Additionally, I learned the<strong>SCRUM</strong> at my university and in a <a href='https://www.lhconsulting.com/' target='_blank'>Lufthansa Consulting</a>  workshop at the <a href='https://consultingcontact.de/' target='_blank'>Consulting Contact</a>.  This helped me to apply it in real-life situations, such as the project seminar<a href='/#/projects#goc'>Game of Competences</a>  and two web development projects at <a href='/#/experience#card-move'>move</a>.",

      "sdevTitle": "Software\nDevelopment",
      "softwareDev": "A Software Developer needs to have a mathematical understanding and aptitude  as well as <strong>problem-solving</strong> skills. These were taught in my Information Systems course along  with programming languages like <strong>Java</strong>. In all honesty, I prefer <strong>JavaScript</strong> and already  implemented a <a href='/#/projects#goc'>web app</a>  with it. In the project, I enhanced my organizational, teamwork, and  <strong>time management</strong> skills as I led a team of seven fellow students. Thorough work and attention  to detail are rewarded in the long term, as I have discovered in the creation process of the  web app. I am looking forward to gaining further experience in Software Development and continually  expand my horizon and adapt to the ever- and fast-changing technology trends."
    }
  },
  "parallaxText": {
    "about": {
      "title": "About Leo",
      "subtitle": "I love breaking down and solving complex and abstract problems!"
    },
    "experience": {
      "title": "Work Experience <br>and Education",
      "subtitle": "I want to broaden my horizons by learning new things and facing challenges!"
    },
    "projects": {
      "title": "Project <br>Experience",
      "subtitle": "Get Inspired by my Projects"
    }
  },
  "experience": {
    "intro": {
      "title": "Work Experience <br>and Education",
      "subtitle": "I want to broaden my horizons by learning new things and facing challenges!"
    },
    "workExperience": "Work Experience",
    "education": "Education"
  },
  "socialTitle": "Connect with me",
  "about": {
    "intro": {
      "title": "About Leo",
      "subtitle": "I love breaking down and solving complex and abstract problems!"
    },
    "introHeader": "What is most important to you?",
    "friendsAndFamily": "For me, my family and friends are the highest priority, because without a great social life as a foundation, it's easy to become unbalanced, burn out and lose sight of what's important in life. That is why I try to make great memories with my family and friends as often as possible. These include our annual ski trips, weekend getaways, or carnival with a group of friends and my family in Cologne.",
    "career": "Besides my private life I invest a lot of energy in my work and career because I have a passion for different IT topics. That's why I study Information Systems (M. Sc.) in Münster and have two part-time jobs with IT focus. The jobs are at the Chair of Information Systems and Information Management as a student assistant and as a working student at viadee in research and development in the Data Science area. In addition, I was able to expand my skillset through consulting projects at <a href='https://move-ev.de/' target='_blank'>move e. V.</a>. I also completed other projects in my spare time or at the university. More insights into these and other projects can be found in my <a href='/experience'>experience overview</a>.",
    "sport": "In addition to work and my private life, I am also very ambitious in sports, as I want to push my limits in various ways: For example, I try to improve my running. Moreover, I ran a half marathon at the age of 16 and run just under 4 min/km on my 10 km route. Over the last few years, I have improved to running a half marathon in under 1h 30 min (see <a href='https://www.strava.com/athletes/17923080' target='_blank'>Strava</a>). During my school years, I played football for a decade and was able to prove myself in the district league. Currently, I only play casually with friends. Instead, I am more active in tennis, home workouts, and beach and indoor volleyball. </br>My favorite sport is skiing because I love the incredible feeling of gliding quickly through the snow and enjoying the great views. It is also fun to do off-piste tours with ascents and then ski through untouched snow. Therefore, I go skiing every year with my family to <a href='https://www.bergfex.com/lech-zuers-arlberg/' target='_blank'>Lech</a> (Austria), with friends to <a href='https://www.bergfex.com/soelden/' target='_blank'>Sölden</a>, or with the university sports to <a href='https://www.bergfex.com/portes-du-soleil/' target='_blank'>Portes du Soleil</a> (Switzerland-France), which is always an eventful and exciting experience because you get to meet many cool people.",
    "travel": "What is more, I would like to explore new places and get to know different cultures, e.g. Asia and South or Central America. Specifically, I would like to travel to Japan and Argentina, Chile or Nicaragua. Additionally, I would like to visit Canada because I enjoy great landscapes and from what I have heard, it has a lot to offer.",
    "quote": "Lastly, I'd like to conclude with a quote, which sums up my life attitude:"
  }
}
